# Import

In [1]:
import pandas as pd

import pymysql
from sqlalchemy import create_engine

# Engine SQL

In [2]:
engine = create_engine('mysql+pymysql://root@localhost/project-week-6')

# Average GDP Per Capita

In [3]:
data = pd.read_csv('../data/average-real-gdp-per-capita-across-countries-and-regions.csv')

In [4]:
data = data.rename(columns={'GDP per capita (int.-$) ($)': 'GDP'})

data

            Entity Code  Year   GDP
0      Afghanistan  AFG  1950  2392
1      Afghanistan  AFG  1951  2422
2      Afghanistan  AFG  1952  2462
3      Afghanistan  AFG  1953  2568
4      Afghanistan  AFG  1954  2576
...            ...  ...   ...   ...
18197     Zimbabwe  ZWE  2012  1623
18198     Zimbabwe  ZWE  2013  1801
18199     Zimbabwe  ZWE  2014  1797
18200     Zimbabwe  ZWE  2015  1759
18201     Zimbabwe  ZWE  2016  1729

[18202 rows x 4 columns]

In [5]:
data.to_sql('gdp_per_capita', engine, if_exists='replace', index=False)

# Corruption Perception

In [6]:
corruption_perception = pd.read_csv('../data/TI-corruption-perception-index.csv')

corruption_perception = corruption_perception.loc[corruption_perception['Year'] == 2016]

corruption_perception

           Entity Code  Year  Corruption Perception Index
4     Afghanistan  AFG  2016                           15
11        Albania  ALB  2016                           39
18        Algeria  DZA  2016                           34
25         Angola  AGO  2016                           18
32      Argentina  ARG  2016                           36
...           ...  ...   ...                          ...
1198    Venezuela  VEN  2016                           17
1205      Vietnam  VNM  2016                           33
1212        Yemen  YEM  2016                           14
1219       Zambia  ZMB  2016                           38
1226     Zimbabwe  ZWE  2016                           22

[176 rows x 4 columns]

In [7]:
average_gdp = pd.read_csv('../data/average-real-gdp-per-capita-across-countries-and-regions.csv')

average_gdp = average_gdp.loc[average_gdp['Year'] == 2016]

average_gdp

                  Entity      Code  Year  GDP per capita (int.-$) ($)
66           Afghanistan       AFG  2016                         1929
133               Africa       NaN  2016                         4680
206              Albania       ALB  2016                        11285
253              Algeria       DZA  2016                        13328
295               Angola       AGO  2016                         8397
...                  ...       ...   ...                          ...
17929  Western Offshoots       NaN  2016                        51342
18000              World  OWID_WRL  2016                        14574
18067              Yemen       YEM  2016                         2199
18134             Zambia       ZMB  2016                         3538
18201           Zimbabwe       ZWE  2016                         1729

[174 rows x 4 columns]

In [8]:
data = pd.merge(corruption_perception, average_gdp, on='Entity', how='left')

data = data.drop(['Code_y', 'Year_y'], axis=1)

data = data.rename(columns={'Code_x': 'Code', 'Year_x': 'Year', 'GDP per capita (int.-$) ($)': 'GDP'})

data

          Entity Code  Year  Corruption Perception Index      GDP
0    Afghanistan  AFG  2016                           15   1929.0
1        Albania  ALB  2016                           39  11285.0
2        Algeria  DZA  2016                           34  13328.0
3         Angola  AGO  2016                           18   8397.0
4      Argentina  ARG  2016                           36  18695.0
..           ...  ...   ...                          ...      ...
171    Venezuela  VEN  2016                           17  13159.0
172      Vietnam  VNM  2016                           33   6031.0
173        Yemen  YEM  2016                           14   2199.0
174       Zambia  ZMB  2016                           38   3538.0
175     Zimbabwe  ZWE  2016                           22   1729.0

[176 rows x 5 columns]

In [9]:
data.to_sql('corruption_perception', engine, if_exists='replace', index=False)

# Economic Freedom

In [10]:
economic_freedom = pd.read_csv('../data/economic-freedom.csv')

economic_freedom = economic_freedom.loc[economic_freedom['Year'] == 2016]

economic_freedom

         Entity Code  Year  Economic Freedom Score
18      Albania  ALB  2016                7.538571
40      Algeria  DZA  2016                4.985321
52       Angola  AGO  2016                5.166513
79    Argentina  ARG  2016                4.839536
92      Armenia  ARM  2016                7.565794
...         ...  ...   ...                     ...
3239  Venezuela  VEN  2016                2.880860
3253    Vietnam  VNM  2016                6.416822
3260      Yemen  YEM  2016                6.370693
3283     Zambia  ZMB  2016                6.603235
3305   Zimbabwe  ZWE  2016                6.077116

[162 rows x 4 columns]

In [11]:
average_gdp = pd.read_csv('../data/average-real-gdp-per-capita-across-countries-and-regions.csv')

average_gdp = average_gdp.loc[average_gdp['Year'] == 2016]

average_gdp = average_gdp.rename(columns={'GDP per capita (int.-$) ($)': 'GDP'})

average_gdp

                  Entity      Code  Year    GDP
66           Afghanistan       AFG  2016   1929
133               Africa       NaN  2016   4680
206              Albania       ALB  2016  11285
253              Algeria       DZA  2016  13328
295               Angola       AGO  2016   8397
...                  ...       ...   ...    ...
17929  Western Offshoots       NaN  2016  51342
18000              World  OWID_WRL  2016  14574
18067              Yemen       YEM  2016   2199
18134             Zambia       ZMB  2016   3538
18201           Zimbabwe       ZWE  2016   1729

[174 rows x 4 columns]

In [12]:
data = pd.merge(economic_freedom, average_gdp, on='Entity', how='left')

data = data.drop(['Code_y', 'Year_y'], axis=1)

data = data.rename(columns={'Code_x': 'Code', 'Year_x': 'Year'})

data

        Entity Code  Year  Economic Freedom Score      GDP
0      Albania  ALB  2016                7.538571  11285.0
1      Algeria  DZA  2016                4.985321  13328.0
2       Angola  AGO  2016                5.166513   8397.0
3    Argentina  ARG  2016                4.839536  18695.0
4      Armenia  ARM  2016                7.565794   9588.0
..         ...  ...   ...                     ...      ...
157  Venezuela  VEN  2016                2.880860  13159.0
158    Vietnam  VNM  2016                6.416822   6031.0
159      Yemen  YEM  2016                6.370693   2199.0
160     Zambia  ZMB  2016                6.603235   3538.0
161   Zimbabwe  ZWE  2016                6.077116   1729.0

[162 rows x 5 columns]

In [13]:
data.to_sql('economic_freedom', engine, if_exists='replace', index=False)

# Extreme Poverty

In [14]:
data = pd.read_csv('../data/world-population-in-extreme-poverty-absolute.csv')

data

,Entity,Code,Year,Number of people not in extreme poverty (people),Number of people living in extreme poverty (people)
0,World,OWID_WRL,1820,1.174362e+08,9.649251e+08
1,World,OWID_WRL,1850,1.641487e+08,1.098533e+09
2,World,OWID_WRL,1870,2.448738e+08,1.154405e+09
3,World,OWID_WRL,1890,3.316867e+08,1.225528e+09
4,World,OWID_WRL,1910,4.550000e+08,1.295000e+09
5,World,OWID_WRL,1929,6.932476e+08,1.351730e+09
6,World,OWID_WRL,1950,9.235800e+08,1.596420e+09
7,World,OWID_WRL,1960,1.387422e+09,1.638581e+09
8,World,OWID_WRL,1970,1.924947e+09,1.766226e+09
9,World,OWID_WRL,1980,2.519491e+09,1.920141e+09
10,World,OWID_WRL,1981,2.609493e+09,1.909109e+09
11,World,OWID_WRL,1984,2.895614e+09,1.870044e+09
12,World,OWID_WRL,1987,3.249321e+09,1.784484e+09
13,World,OWID_WRL,1990,3.406152e+09,1.903516e+09
14,World,OWID_WRL,1993,3.683471e+09,1.886574e+09
15,World,OWID_WRL,1996,4.105667e+09,1.709725e+09
16,World,OWID_WRL,1999,4.317318e+09,1.731887e+09
17,World,OWID_WRL,2002,4.670891e+09,1.611410e+09
18,World,OWID_WRL,2005,5.166811e+09,1.352824e+09
19,World,OWID_WRL,2008,5.540174e+09,1.223559e+09
20,World,OWID_WRL,2010,5.838986e+09,1.090739e+09
21,World,OWID_WRL,2011,6.050484e+09,9.629435e+08
22,World,OWID_WRL,2012,6.189020e+09,9.084801e+08
23,World,OWID_WRL,2013,6.302580e+09,7.949201e+08
24,World,OWID_WRL,2015,6.615995e+09,7.334773e+08

In [15]:
data.to_sql('extreme_poverty', engine, if_exists='replace', index=False)

# Gross Domestic Product

In [16]:
data = pd.read_csv('../data/gross-domestic-product.csv')

In [17]:
data = data.dropna()

data = data.rename(columns={'GDP (constant 2010 US$) (constant 2010 US$)': 'GDP Total'})

data

            Entity Code  Year     GDP Total
0      Afghanistan  AFG  2002  8.013233e+09
1      Afghanistan  AFG  2003  8.689884e+09
2      Afghanistan  AFG  2004  8.781610e+09
3      Afghanistan  AFG  2005  9.762979e+09
4      Afghanistan  AFG  2006  1.030523e+10
...            ...  ...   ...           ...
11251     Zimbabwe  ZWE  2013  1.418193e+10
11252     Zimbabwe  ZWE  2014  1.448359e+10
11253     Zimbabwe  ZWE  2015  1.472830e+10
11254     Zimbabwe  ZWE  2016  1.481899e+10
11255     Zimbabwe  ZWE  2017  1.532981e+10

[8959 rows x 4 columns]

In [18]:
data.to_sql('gross_domestic_product', engine, if_exists='replace', index=False)

# Landlocked Countries

In [19]:
landlocked = pd.read_csv('../data/landlocked_countries 2020.csv')

landlocked['Landlocked'] = 'Yes'

landlocked["Landlocked"] = landlocked["Landlocked"].astype(str).astype(object)

landlocked = landlocked.rename(columns={'country': 'Country'})

landlocked

                     Country     pop2020 Landlocked
0                   Ethiopia  114963.588        Yes
1                     Uganda   45741.007        Yes
2                Afghanistan   38928.346        Yes
3                 Uzbekistan   33469.203        Yes
4                      Nepal   29136.808        Yes
5                      Niger   24206.644        Yes
6               Burkina Faso   20903.273        Yes
7                       Mali   20250.833        Yes
8                     Malawi   19129.952        Yes
9                 Kazakhstan   18776.707        Yes
10                    Zambia   18383.955        Yes
11                      Chad   16425.864        Yes
12                  Zimbabwe   14862.924        Yes
13                    Rwanda   12952.218        Yes
14                   Burundi   11890.784        Yes
15                   Bolivia   11673.021        Yes
16               South Sudan   11193.725        Yes
17            Czech Republic   10708.981        Yes
18                Azerbaijan   10139.177        Yes
19                   Hungary    9660.351        Yes
20                Tajikistan    9537.645        Yes
21                   Belarus    9449.323        Yes
22                   Austria    9006.398        Yes
23                    Serbia    8737.371        Yes
24               Switzerland    8654.622        Yes
25                      Laos    7275.560        Yes
26                  Paraguay    7132.538        Yes
27                Kyrgyzstan    6524.195        Yes
28              Turkmenistan    6031.200        Yes
29                  Slovakia    5459.642        Yes
30  Central African Republic    4829.767        Yes
31                   Moldova    4033.963        Yes
32                  Mongolia    3278.290        Yes
33                   Armenia    2963.243        Yes
34                  Botswana    2351.627        Yes
35                   Lesotho    2142.249        Yes
36                 Macedonia    2083.374        Yes
37                 Swaziland    1160.164        Yes
38                    Bhutan     771.608        Yes
39                Luxembourg     625.978        Yes
40                   Andorra      77.265        Yes
41             Liechtenstein      38.128        Yes
42                San Marino      33.931        Yes
43              Vatican City       0.801        Yes

In [20]:
year2016_data_countries = pd.read_csv('../data/average-real-gdp-per-capita-across-countries-and-regions.csv')

year2016_data_countries = year2016_data_countries.loc[year2016_data_countries['Year'] == 2016]

year2016_data_countries = year2016_data_countries.dropna()

year2016_data_countries = year2016_data_countries.drop(18000)

year2016_data_countries = year2016_data_countries.rename(columns={'GDP per capita (int.-$) ($)': 'GDP', 'Entity': 'Country'})

year2016_data_countries

           Country Code  Year    GDP
66     Afghanistan  AFG  2016   1929
206        Albania  ALB  2016  11285
253        Algeria  DZA  2016  13328
295         Angola  AGO  2016   8397
442      Argentina  ARG  2016  18695
...            ...  ...   ...    ...
17498    Venezuela  VEN  2016  13159
17568      Vietnam  VNM  2016   6031
18067        Yemen  YEM  2016   2199
18134       Zambia  ZMB  2016   3538
18201     Zimbabwe  ZWE  2016   1729

[164 rows x 4 columns]

In [21]:
data = pd.merge(year2016_data_countries, landlocked, on='Country', how='left')

data['Landlocked'] = data['Landlocked'].fillna('No')

data = data.drop(['pop2020', 'Year'], axis=1)

data

         Country Code    GDP Landlocked
0    Afghanistan  AFG   1929        Yes
1        Albania  ALB  11285         No
2        Algeria  DZA  13328         No
3         Angola  AGO   8397         No
4      Argentina  ARG  18695         No
..           ...  ...    ...        ...
159    Venezuela  VEN  13159         No
160      Vietnam  VNM   6031         No
161        Yemen  YEM   2199         No
162       Zambia  ZMB   3538        Yes
163     Zimbabwe  ZWE   1729        Yes

[164 rows x 4 columns]

In [22]:
data.to_sql('landlocked_countries', engine, if_exists='replace', index=False)

# Natural resources rents

In [23]:
natural_resource = pd.read_csv('../data/natural-resource-rents.csv')

natural_resource = natural_resource.loc[natural_resource['Year'] == 2016]

natural_resource = natural_resource.rename(columns={'Total natural resources rents (% of GDP) (% of GDP)': 'Natural resources of GDP'})

natural_resource

               Entity      Code  Year  Natural resources of GDP
27        Afghanistan       AFG  2016                  0.598008
60            Albania       ALB  2016                  1.973313
107           Algeria       DZA  2016                 13.631655
122    American Samoa       ASM  2016                  0.000000
169           Andorra       AND  2016                  0.000000
...               ...       ...   ...                       ...
10080         Vietnam       VNM  2016                  2.301114
10127           World  OWID_WRL  2016                  1.894270
10154           Yemen       YEM  2016                  0.982571
10201          Zambia       ZMB  2016                 15.133440
10248        Zimbabwe       ZWE  2016                  8.754979

[237 rows x 4 columns]

In [24]:
gdp = pd.read_csv('../data/average-real-gdp-per-capita-across-countries-and-regions.csv')

gdp = gdp.loc[gdp['Year'] == 2016]

gdp = gdp.rename(columns={'GDP per capita (int.-$) ($)': 'GDP'})

gdp

                  Entity      Code  Year    GDP
66           Afghanistan       AFG  2016   1929
133               Africa       NaN  2016   4680
206              Albania       ALB  2016  11285
253              Algeria       DZA  2016  13328
295               Angola       AGO  2016   8397
...                  ...       ...   ...    ...
17929  Western Offshoots       NaN  2016  51342
18000              World  OWID_WRL  2016  14574
18067              Yemen       YEM  2016   2199
18134             Zambia       ZMB  2016   3538
18201           Zimbabwe       ZWE  2016   1729

[174 rows x 4 columns]

In [25]:
data = pd.merge(gdp, natural_resource, on='Entity', how='left')

data = data.dropna()

data = data.drop(170)

data = data.drop(['Code_y', 'Year_y'], axis=1)

data = data.rename(columns={'Entity': 'Country', 'Code_x': 'Code', 'Year_x': 'Year'})

data

         Country Code  Year    GDP  Natural resources of GDP
0    Afghanistan  AFG  2016   1929                  0.598008
2        Albania  ALB  2016  11285                  1.973313
3        Algeria  DZA  2016  13328                 13.631655
4         Angola  AGO  2016   8397                 13.217494
5      Argentina  ARG  2016  18695                  1.302412
..           ...  ...   ...    ...                       ...
164   Uzbekistan  UZB  2016   9726                 11.436286
166      Vietnam  VNM  2016   6031                  2.301114
171        Yemen  YEM  2016   2199                  0.982571
172       Zambia  ZMB  2016   3538                 15.133440
173     Zimbabwe  ZWE  2016   1729                  8.754979

[158 rows x 5 columns]

In [26]:
data.to_sql('natural_resources_gdp', engine, if_exists='replace', index=False)

# Political Regime

In [27]:
political_regime = pd.read_csv('../data/political-regime-updated2016.csv')

political_regime = political_regime.loc[political_regime['Year'] == 2015]

political_regime

,Entity,Code,Year,Political Regime (OWID based on Polity IV and Wimmer & Min) (Score)
176,Afghanistan,AFG,2015,-1
375,Albania,ALB,2015,9
575,Algeria,DZA,2015,2
775,Angola,AGO,2015,-2
966,Argentina,ARG,2015,9
...,...,...,...,...
28547,Venezuela,VEN,2015,4
28586,Vietnam,VNM,2015,-7
28761,Yemen,YEM,2015,0
28961,Zambia,ZMB,2015,7
29156,Zimbabwe,ZWE,2015,4

In [28]:
average_gdp = pd.read_csv('../data/average-real-gdp-per-capita-across-countries-and-regions.csv')

average_gdp = average_gdp.loc[average_gdp['Year'] == 2015]

average_gdp

                  Entity      Code  Year  GDP per capita (int.-$) ($)
65           Afghanistan       AFG  2015                         1928
132               Africa       NaN  2015                         4684
205              Albania       ALB  2015                        10947
252              Algeria       DZA  2015                        13024
294               Angola       AGO  2015                         8631
...                  ...       ...   ...                          ...
17928  Western Offshoots       NaN  2015                        50951
17999              World  OWID_WRL  2015                        14500
18066              Yemen       YEM  2015                         2496
18133             Zambia       ZMB  2015                         3537
18200           Zimbabwe       ZWE  2015                         1759

[177 rows x 4 columns]

In [29]:
data = pd.merge(political_regime, average_gdp, on='Entity', how='left')

data = data.drop(['Code_y', 'Year_y'], axis=1)

data = data.rename(columns={'Code_x': 'Code', 'Year_x': 'Year', 'Political Regime (OWID based on Polity IV and Wimmer & Min) (Score)': 'Political Regime Score', 'GDP per capita (int.-$) ($)': 'GDP'})

data

          Entity Code  Year  Political Regime Score      GDP
0    Afghanistan  AFG  2015                      -1   1928.0
1        Albania  ALB  2015                       9  10947.0
2        Algeria  DZA  2015                       2  13024.0
3         Angola  AGO  2015                      -2   8631.0
4      Argentina  ARG  2015                       9  19316.0
..           ...  ...   ...                     ...      ...
157    Venezuela  VEN  2015                       4  16257.0
158      Vietnam  VNM  2015                      -7   5733.0
159        Yemen  YEM  2015                       0   2496.0
160       Zambia  ZMB  2015                       7   3537.0
161     Zimbabwe  ZWE  2015                       4   1759.0

[162 rows x 5 columns]

In [30]:
data.to_sql('political_regime', engine, if_exists='replace', index=False)

# UK GDP

In [31]:
data = pd.read_csv('../data/GDP-per-capita-in-the-uk-since-1270.csv')

In [32]:
data = data.rename(columns={'Real GDP per capita  (£)': 'GDP'})

data

             Entity Code  Year          GDP
0    United Kingdom  GBR  1270    805.91998
1    United Kingdom  GBR  1271    796.29999
2    United Kingdom  GBR  1272    824.89001
3    United Kingdom  GBR  1273    776.84998
4    United Kingdom  GBR  1274    772.75000
..              ...  ...   ...          ...
742  United Kingdom  GBR  2012  27206.47100
743  United Kingdom  GBR  2013  27544.32000
744  United Kingdom  GBR  2014  28256.80100
745  United Kingdom  GBR  2015  28692.97100
746  United Kingdom  GBR  2016  28982.27000

[747 rows x 4 columns]

In [33]:
data.to_sql('uk_gdp', engine, if_exists='replace', index=False)

# Urbanization

In [34]:
data = pd.read_csv('../data/urbanization-vs-gdp.csv')

In [35]:
data = data.rename(columns={'Share of population living in urban areas (%)': 'Share of population living in urban areas', 'GDP per capita (2011 int-$) ($)' : 'GDP', 'Total population (Gapminder)' : 'Total Population'})

data

,Entity,Code,Year,Share of population living in urban areas,GDP,Total Population
0,Afghanistan,AFG,1800,NaN,NaN,3280000.0
1,Afghanistan,AFG,1820,NaN,NaN,3280000.0
2,Afghanistan,AFG,1870,NaN,NaN,4207000.0
3,Afghanistan,AFG,1913,NaN,NaN,5730000.0
4,Afghanistan,AFG,1950,6.000,2392.0,8151455.0
...,...,...,...,...,...,...
28360,Zimbabwe,ZWE,2012,32.834,1623.0,13013678.0
28361,Zimbabwe,ZWE,2013,32.654,1801.0,13327925.0
28362,Zimbabwe,ZWE,2014,32.504,1797.0,NaN
28363,Zimbabwe,ZWE,2015,32.385,1759.0,NaN
28364,Zimbabwe,ZWE,2016,32.296,1729.0,NaN

In [36]:
data.to_sql('urbanization', engine, if_exists='replace', index=False)

# World GDP

In [37]:
data = pd.read_csv('../data/world-gdp-over-the-last-two-millennia.csv')

In [38]:
data = data.rename(columns={' (int.-$)': 'GDP'})

data

   Entity      Code  Year           GDP
0   World  OWID_WRL     1  1.827410e+11
1   World  OWID_WRL  1000  2.101447e+11
2   World  OWID_WRL  1500  4.305273e+11
3   World  OWID_WRL  1600  5.744687e+11
4   World  OWID_WRL  1700  6.433229e+11
..    ...       ...   ...           ...
71  World  OWID_WRL  2011  9.498240e+13
72  World  OWID_WRL  2012  9.803230e+13
73  World  OWID_WRL  2013  1.012700e+14
74  World  OWID_WRL  2014  1.047200e+14
75  World  OWID_WRL  2015  1.081200e+14

[76 rows x 4 columns]

In [39]:
data.to_sql('world_gdp', engine, if_exists='replace', index=False)